from aiogram import Router
from aiogram.types import Message
from aiogram.filters import Command

from keyboards.keyboard import mainmenu_keyboard


help_router = Router()


@help_router.message(Command("help"))
async def help(message: Message):
    await message.answer('''
ℹ️ Довідка по боту

🤖 Я — ChatGPT-бот, який відповідає з урахуванням контексту діалогу.

📌 Команди:
    /start — почати роботу з ботом
    /help — показати цю довідку
    /mode — змінити режим роботи
    /clear — очистити історію діалогу

🔧 Режими роботи:
    🧠 Перетворення  
        • Перетворюю голосові повідомлення у текст  
        • Аналізую відео та витягую текст  
        • Підходить для розшифровки аудіо та відео

    🌍 Переклад  
        • Перекладаю текст між різними мовами  
        • Можу визначити мову автоматично  
        • Підходить для навчання та роботи

    📚 Навчання  
        • Пояснюю складні теми простими словами  
        • Допомагаю з кодом, термінами та прикладами  
        • Підходить для навчання і саморозвитку

🧠 Контекст:
    • Я памʼятаю попередні повідомлення
    • Можеш очистити історію командою /clear

⚠️ Якщо відповідь довго генерується або сталася помилка — спробуй пізніше

🚀 Просто напиши повідомлення — я відповім!
    ''', reply_markup=mainmenu_keyboard)